#### Groupby :  This is similar to pivot tables in Excel, where it is possible to group data based on a parameter in a column

In [1]:
import numpy as np
import pandas as pd

In [3]:
dic = {'Region': ['South', 'South', 'North','North', 'East', 'West'],
      'SalesRep':['John','Sam', 'Joseph', 'Krish','Mary','Sid'],
      'Sale':[300, 200, 100, 345, 450, 439]}
df = pd.DataFrame(data = dic)
df

  Region SalesRep  Sale
0  South     John   300
1  South      Sam   200
2  North   Joseph   100
3  North    Krish   345
4   East     Mary   450
5   West      Sid   439

#### Making  a groupby Region Sale figures , Sum of them : Note the groupby works on a categorical column and gives a aggregation function on a numerical column. If data frame has numerical columns, only them aggregate functions like sum(), mean() make sense

In [4]:
Region_sales  = df.groupby('Region')
Region_sales

In [6]:
# Sum by region
Region_sales.sum()

        Sale
Region
East     450
North    445
South    500
West     439

In [7]:
#mean by Region
Region_sales.mean()

         Sale
Region
East    450.0
North   222.5
South   250.0
West    439.0

In [8]:
Region_sales.min()

       SalesRep  Sale
Region
East       Mary   450
North    Joseph   100
South      John   200
West        Sid   439

In [9]:
Region_sales.max()

       SalesRep  Sale
Region
East       Mary   450
North     Krish   345
South       Sam   300
West        Sid   439

#### Describe on the groupby object

In [10]:
Region_sales.describe()

        Sale
       count   mean         std    min     25%    50%     75%    max
Region
East     1.0  450.0         NaN  450.0  450.00  450.0  450.00  450.0
North    2.0  222.5  173.241161  100.0  161.25  222.5  283.75  345.0
South    2.0  250.0   70.710678  200.0  225.00  250.0  275.00  300.0
West     1.0  439.0         NaN  439.0  439.00  439.0  439.00  439.0